app/controllers/client/treatments_controller.rb

   def create
     @treatment = Treatment.new(treatment_params)
     @treatment.user = current_user

     if @treatment.save
---
INSERT INTO "treatments" ("user_id", "name", "start_date", "main_purpose", "other_purpose", "service_concerned", "service_function", "category_people_concerned", "personal_data", "sensitive_data", "recipient", "storage_time", "observation", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"

   def update
     @treatment.update(treatment_params)
---
UPDATE "treatments" SET "name" = $1, "updated_at" = $2 WHERE "treatments"."id" = $3  [["name", "Traitement essai 2"], ["updated_at", "2017-12-22 07:11:52.627960"], ["id", 5]]

   def destroy
     @treatment.destroy
---
DELETE FROM "treatments" WHERE "treatments"."id" = $1  [["id", 3]]

   def set_treatment
     @treatment = Treatment.find(params[:id])
---
SELECT  "treatments".* FROM "treatments" WHERE "treatments"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]