app/views/users/index.html.erb

          <div class="individual-data-data">
            <%= Treatment.count %>
---
SELECT COUNT(*) FROM "treatments"