app/controllers/users_controller.rb

  def update
    @user.update(user_params)
---
UPDATE "users" SET "role" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["role", 1], ["updated_at", "2018-01-02 18:18:24.134540"], ["id", 1]]

  def destroy
    user = User.find(params[:id])
    user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]